{
    "renewableEnergySources": [
      {
        "title": "Solar Energy",
        "description": "Solar energy harnesses the power of the sun to generate electricity through photovoltaic (PV) panels.",
        "imageUrl": "assets/sources/solar.jpg",
        "route":"SolarEnergy"
      },
      {
        "title": "Wind Energy",
        "description": "Wind turbines capture the kinetic energy of the wind and convert it into electricity.",
        "imageUrl": "assets/sources/wind.jpg",
        "route":"WindEnergy"
      },
      {
        "title": "Hydropower",
        "description": "Hydropower utilizes the energy of flowing or falling water to generate electricity.",
        "imageUrl": "assets/sources/hydropower.jpg",
        "route":"Hydropower"
      },
      {
        "title": "Geothermal Energy",
        "description": "Geothermal energy utilizes the heat from the Earth's core to generate electricity or heat buildings.",
        "imageUrl": "assets/sources/geothermal.jpg",
        "route":"Geothermal"
      },
      {
        "title": "Biomass Energy",
        "description": "Biomass energy is derived from organic materials, such as plant matter, agricultural residues, and wood.",
        "imageUrl": "assets/sources/biomass.jpg",
        "route":"Biomass"
      },
      {
        "title": "Wave Energy",
        "description": "Wave energy converts the motion of ocean waves into electricity.",
        "imageUrl": "assets/sources/wave.jpg",
        "route":"WaveEnergy"
      }
    ],
    "tools": [
      {
        "title": "Energy Consumption Calculator",
        "description": "Calculate your household or business energy consumption to identify usage patterns and save energy.",
        "imageUrl": "assets/tools/energy-consumption-calculator.jpg",
        "componentType" : "Tools",
        "route":"EnergyConsumptionCalculator"
      },
      {
        "title": "Carbon Footprint Calculator",
        "description": "Measure your carbon footprint based on lifestyle choices and get tips for reducing emissions.",
        "imageUrl": "assets/tools/carbon-footprint-calculator.jpg",
        "componentType" : "Tools",
        "route":"CarbonFootprintCalculator"
      },
      {
        "title": "Solar Panel Cost Estimator",
        "description": "Estimate the cost and potential savings of installing solar panels on your rooftop.",
        "imageUrl": "assets/tools/solar-panel-costing.jpg",
        "componentType" : "Tools",
        "route":"SolarPanelCostEstimator"
      },
      {
        "title": "Electric Vehicle Savings Calculator",
        "description": "Compare the costs and savings of owning an electric vehicle versus a gasoline vehicle.",
        "imageUrl": "assets/tools/electric-vehicle-costing.jpg",
        "componentType" : "Tools",
        "route":"ElectricVehicleSavingsCalculator"
      }
    ],
      "energy_sources_details": [
        {
          "title": "Solar Energy",
          "imageUrl": "https://example.com/solar_image.jpg",
          "description": "Solar energy is harnessed from the sun's rays using photovoltaic cells or solar thermal technology. Photovoltaic cells convert sunlight directly into electricity, while solar thermal technology uses sunlight to heat a fluid and generate electricity. Solar energy is clean, renewable, and abundant, making it a popular choice for generating electricity and heating water for residential and commercial purposes."
        },
        {
          "title": "Wind Energy",
          "imageUrl": "https://example.com/wind_image.jpg",
          "description": "Wind energy is generated by harnessing the kinetic energy of moving air through wind turbines. These turbines convert the wind's rotational energy into electricity. Wind power is a sustainable and emissions-free energy source, making it an essential part of the renewable energy mix. Wind farms are often installed in windy regions and offshore locations to maximize electricity generation."
        },
        {
          "title": "Hydropower",
          "imageUrl": "https://example.com/hydropower_image.jpg",
          "description": "Hydropower, also known as hydroelectric power, is derived from the energy of flowing or falling water. It is one of the oldest renewable energy sources used to generate electricity. Hydropower plants use dams and reservoirs to store water, and as water is released from higher levels to lower levels, it spins turbines, which, in turn, produce electricity. Hydropower is a reliable and eco-friendly energy source with low greenhouse gas emissions."
        },
        {
          "title": "Biomass Energy",
          "imageUrl": "https://example.com/biomass_image.jpg",
          "description": "Biomass energy is produced from organic materials like plant matter, agricultural residues, wood pellets, and organic waste. These materials can be burned directly or converted into biofuels like biogas, bioethanol, and biodiesel. Biomass energy is considered renewable because plants and organic materials can be regrown or replenished. It is often used for heat and electricity generation and as a sustainable alternative to fossil fuels."
        },
        {
          "title": "Geothermal Energy",
          "imageUrl": "https://example.com/geothermal_image.jpg",
          "description": "Geothermal energy is obtained from the heat generated within the Earth's crust. It involves harnessing hot water and steam from geothermal reservoirs underground to produce electricity through geothermal power plants. Geothermal energy is a reliable and sustainable energy source, as it produces minimal greenhouse gas emissions and has a small land footprint compared to other renewable energy sources."
        }
      ]
    }
    
  